{
  "tags": [
    { "id": "tag-001", "name": "Urgente", "color": "#ef4444", "description": "Requiere atención inmediata", "companyId": "co-01" },
    { "id": "tag-002", "name": "Bug", "color": "#f97316", "description": "Error en el sistema", "companyId": "co-01" },
    { "id": "tag-003", "name": "Feature", "color": "#3b82f6", "description": "Nueva funcionalidad", "companyId": "co-01" },
    { "id": "tag-004", "name": "Documentación", "color": "#22c55e", "description": "Relacionado con documentación", "companyId": "co-01" },
    { "id": "tag-005", "name": "Critical", "color": "#dc2626", "description": "Problema crítico del sistema", "companyId": "co-01" },
    { "id": "tag-006", "name": "Integration", "color": "#0ea5e9", "description": "Integraciones con terceros", "companyId": "co-01" },
    { "id": "tag-007", "name": "Access", "color": "#14b8a6", "description": "Permisos y accesos", "companyId": "co-02" },
    { "id": "tag-008", "name": "High Priority", "color": "#ef4444", "description": "Alta prioridad", "companyId": "co-02" },
    { "id": "tag-009", "name": "Bug", "color": "#f97316", "description": "Error en el sistema", "companyId": "co-02" },
    { "id": "tag-010", "name": "Permissions", "color": "#8b5cf6", "description": "Gestión de permisos", "companyId": "co-02" },
    { "id": "tag-011", "name": "Documentation", "color": "#22c55e", "description": "Relacionado con documentación", "companyId": "co-02" },
    { "id": "tag-012", "name": "Performance", "color": "#f59e0b", "description": "Optimización de rendimiento", "companyId": "co-02" },
    { "id": "tag-013", "name": "Feature", "color": "#3b82f6", "description": "Nueva funcionalidad", "companyId": "co-03" },
    { "id": "tag-014", "name": "Enhancement", "color": "#10b981", "description": "Mejora de funcionalidad existente", "companyId": "co-03" },
    { "id": "tag-015", "name": "Performance", "color": "#f59e0b", "description": "Optimización de rendimiento", "companyId": "co-03" },
    { "id": "tag-016", "name": "Bug", "color": "#f97316", "description": "Error en el sistema", "companyId": "co-03" },
    { "id": "tag-017", "name": "High Priority", "color": "#ef4444", "description": "Alta prioridad", "companyId": "co-03" }
  ],
  "companies": [
    { "id": "co-01", "name": "Acme Corporation" },
    { "id": "co-02", "name": "Global Tech Solutions" },
    { "id": "co-03", "name": "Innovation Labs Inc." }
  ],
  "articles": [
    {
      "id": "issue-0001",
      "companyId": "co-01",
      "title": "No se puede iniciar sesión en la cuenta después de cambiar la contraseña",
      "description": "Descripción detallada del problema: Los usuarios reportan que después de cambiar su contraseña utilizando el flujo de recuperación, no pueden iniciar sesión con la nueva contraseña. El sistema muestra un error genérico 'Credenciales inválidas' sin proporcionar más detalles. Este issue afecta múltiples áreas del sistema y está impactando la experiencia del usuario de manera significativa.",
      "externalLink": "https://external-tracker.com/issue-0001",
      "clientComments": "Cliente reportó: 'No se puede iniciar sesión después del cambio de contraseña. Ya intentamos con múltiples usuarios y todos tienen el mismo problema'. Mencionaron que esto ha estado afectando su flujo de trabajo durante los últimos 3 días y están perdiendo productividad. Solicitan una solución urgente ya que tienen empleados bloqueados.",
      "status": "Producción",
      "tags": ["tag-001", "tag-002"],
      "createdAt": "2026-01-02",
      "updatedAt": "2026-01-20"
    },
    {
      "id": "issue-0002",
      "companyId": "co-01",
      "title": "La configuración de SSO no funciona con Okta",
      "description": "Error al intentar sincronizar usuarios vía SAML. El sistema no reconoce los atributos enviados por el proveedor de identidad Okta, lo que impide que los usuarios puedan autenticarse mediante Single Sign-On. Se requiere revisar la configuración de mapeo de atributos SAML.",
      "externalLink": "https://external-tracker.com/issue-0002",
      "clientComments": "El departamento de IT requiere asistencia técnica inmediata. Han intentado múltiples configuraciones sin éxito y necesitan soporte especializado para resolver la integración con Okta.",
      "status": "Borrador",
      "tags": ["tag-004", "tag-003"],
      "createdAt": "2025-07-27",
      "updatedAt": "2026-01-18"
    },
    {
      "id": "issue-0003",
      "companyId": "co-02",
      "title": "Solicitud de acceso al entorno sandbox",
      "description": "El cliente necesita acceso al entorno de pruebas para realizar validaciones antes del despliegue en producción. Requieren permisos completos de administrador para poder probar todas las funcionalidades que implementarán en su entorno productivo. El acceso debe incluir la posibilidad de crear usuarios de prueba y simular diferentes escenarios de uso.",
      "externalLink": "https://external-tracker.com/issue-0003",
      "clientComments": "Solicitud urgente para el equipo de QA. Necesitamos comenzar las pruebas lo antes posible ya que tenemos un deadline ajustado para el lanzamiento a producción. Por favor, priorizar esta solicitud.",
      "status": "Borrador",
      "tags": ["tag-007", "tag-008"],
      "createdAt": "2026-01-08",
      "updatedAt": "2026-01-19"
    },
    {
      "id": "issue-0004",
      "companyId": "co-02",
      "title": "Error de permisos al agregar miembros al equipo",
      "description": "Los administradores no pueden agregar nuevos miembros al equipo debido a un error de permisos en el sistema. Al intentar enviar la invitación, el sistema responde con un error 403 Forbidden. Se ha verificado que los administradores tienen los roles correctos asignados. Parece ser un problema con la validación de permisos en el backend.",
      "externalLink": "https://external-tracker.com/issue-0004",
      "clientComments": "Este problema está bloqueando la incorporación de nuevos empleados. Tenemos 5 nuevos colaboradores que deben empezar esta semana y no podemos darles acceso al sistema. La situación es crítica para nuestras operaciones.",
      "status": "Borrador",
      "tags": ["tag-009", "tag-010"],
      "createdAt": "2025-12-10",
      "updatedAt": "2026-01-15"
    },
    {
      "id": "issue-0005",
      "companyId": "co-01",
      "title": "Integración con sistema de pagos no funciona",
      "description": "La integración con Stripe está fallando intermitentemente, causando errores en las transacciones de los clientes. Los errores ocurren aproximadamente en el 30% de los intentos de pago. Los logs muestran timeouts al conectar con la API de Stripe. Se necesita investigar si el problema es de configuración, de red, o si Stripe está experimentando problemas en su infraestructura.",
      "externalLink": "https://external-tracker.com/issue-0005",
      "clientComments": "Los clientes reportan errores al procesar pagos. Esto está causando pérdida de ventas y una muy mala experiencia para nuestros usuarios finales. Necesitamos una solución inmediata o consideraremos cambiar de proveedor de pagos. Este es un issue crítico para nuestro negocio.",
      "status": "Producción",
      "tags": ["tag-005", "tag-006", "tag-002"],
      "createdAt": "2026-01-15",
      "updatedAt": "2026-01-21"
    },
    {
      "id": "issue-0006",
      "companyId": "co-02",
      "title": "Actualización de documentación del API",
      "description": "Necesitamos actualizar la documentación del API para reflejar los cambios recientes en los endpoints. Se han agregado nuevos parámetros opcionales y algunos endpoints deprecados necesitan ser marcados como tal. También se requiere incluir ejemplos de código actualizados en diferentes lenguajes de programación (JavaScript, Python, Ruby).",
      "externalLink": "https://external-tracker.com/issue-0006",
      "clientComments": "La documentación actual está desactualizada y está causando confusión en nuestro equipo de desarrollo. Varios desarrolladores han perdido tiempo intentando usar endpoints que ya no funcionan como se describe. Por favor, actualizar lo antes posible.",
      "status": "Borrador",
      "tags": ["tag-011"],
      "createdAt": "2026-01-10",
      "updatedAt": "2026-01-18"
    },
    {
      "id": "issue-0007",
      "companyId": "co-03",
      "title": "Solicitud de nueva funcionalidad: Exportar reportes a Excel",
      "description": "Los usuarios necesitan poder exportar los reportes del sistema a formato Excel para análisis offline. La funcionalidad debe permitir exportar tanto datos crudos como reportes con gráficos. Se requiere que el formato sea compatible con Excel 2016 y versiones posteriores.",
      "externalLink": "",
      "clientComments": "Esta funcionalidad es muy importante para nuestro equipo de análisis. Actualmente tienen que copiar y pegar datos manualmente, lo cual es muy ineficiente y propenso a errores. Una solución automatizada mejoraría significativamente su productividad.",
      "status": "Producción",
      "tags": ["tag-013", "tag-014"],
      "createdAt": "2026-01-12",
      "updatedAt": "2026-01-19"
    },
    {
      "id": "issue-0008",
      "companyId": "co-03",
      "title": "Problema de rendimiento en dashboard con muchos widgets",
      "description": "El dashboard se vuelve muy lento cuando se agregan más de 10 widgets. La carga inicial puede tomar hasta 30 segundos y la interacción con los widgets es muy lenta. Se necesita optimizar las consultas a la base de datos y posiblemente implementar paginación o carga lazy de widgets.",
      "externalLink": "https://external-tracker.com/issue-0008",
      "clientComments": "El rendimiento es inaceptable. Nuestros usuarios se quejan constantemente de la lentitud del dashboard. Algunos han dejado de usarlo completamente. Necesitamos una solución urgente o el producto perderá adopción.",
      "status": "Borrador",
      "tags": ["tag-015", "tag-016", "tag-017"],
      "createdAt": "2026-01-05",
      "updatedAt": "2026-01-20"
    }
  ]
}
